{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "hidden_size": 896,
  "intermediate_size": 4864,
  "max_position_embeddings": 512,
  "model_type": "llama",
  "num_attention_heads": 14,
  "num_hidden_layers": 24,
  "num_key_value_heads": 2,
  "rms_norm_eps": 9.999999747378752e-6,
  "rope_theta": 1000000.0,
  "tie_word_embeddings": false,
  "use_cache": true,
  "vocab_size": 151936
}