{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "model_type": "qwen2",
  "hidden_size": 896,
  "num_hidden_layers": 24,
  "num_attention_heads": 14,
  "num_key_value_heads": 2,
  "intermediate_size": 4864,
  "vocab_size": 151936,
  "max_position_embeddings": 512,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "tie_word_embeddings": true,
  "use_cache": true
}